In [1]:
import pandas as pd
import numpy as np

In [5]:
# 隐式创建:在生产创建DataFrame的时候手动传入索引，传入的索引个数需要和数据长度相对应，比如
# 有4列，那么columns就要传入4个值
df = pd.DataFrame(
    #生产数据
    np.random.randint(70,100,size = (2,4)),
    index = ['girl','boy'],
    # 如果索引是嵌套数据，那么除了最内层外，其他层在数据在一定程度上可以合并的
    columns = [
              ['A','A','A','A'],
              ['English','English','Chinese','Chinese'],
              ['like','dislike','like','dislike']
              ]
)
df

           A
     English         Chinese
        like dislike    like dislike
girl      82      82      77      82
boy       83      87      86      71

In [ ]:
# 显示创建：使用pandas.MultiIndex创建
# 自动调整以适应索引数，在构造的时候就不用每个都写
df1 = pd.DataFrame(
    #生产数据
    np.random.randint(70,100,size = (2,4)),
    index = ['girl','boy'],
    columns = pd.MultiIndex.from_product([
            # 第一层索引
              ['English','Chinese'],
            # 第二次索引
              ['like','dislike']
              ])
)
df1

#### 多级索引的检索

In [15]:
# 使用隐式创建
s = pd.Series(np.random.randint(0,100,size = 6),
        index = [['A','A','B','B','C','C'],
                ['期中','期末','期中','期末','期中','期末']])
s

A  期中    26
   期末    98
B  期中    29
   期末    42
C  期中    88
   期末     8
dtype: int32

In [16]:
# 取第一层索引下的数据
s['A']

期中    26
期末    98
dtype: int32

In [18]:
# 取多个第一层索引的数据
s[['A','B']]

A  期中    26
   期末    98
B  期中    29
   期末    42
dtype: int32

In [19]:
s['A']['期中']

26

In [21]:
# 使用iloc的时候索引的最大值为最内层索引个数
s.iloc[4]

88

#### DataFrame

In [26]:
df3 = pd.DataFrame([10,20,30,40,50,60,70,80,90],
                  index = [['小说','小说','小说','散文随笔','散文随笔','散文随笔','传记','传记','传记'],
                          ['高三上的邮局','失踪的总统','绿毛水怪','皮囊','浮生六记','自在独行','梅西','老舍自传','库里传']],
                  columns=['peice'],
                  )
df3

             peice
小说   高三上的邮局     10
     失踪的总统      20
     绿毛水怪       30
散文随笔 皮囊         40
     浮生六记       50
     自在独行       60
传记   梅西         70
     老舍自传       80
     库里传        90

In [29]:
# loc['第一层行索引名称','第二层行索引名称']['列索引']
df3.loc['传记','梅西']['peice']

70

#### 多级索引的相关操作

In [30]:
# 1.使用swaplevel()交换分层顺序，交换内层和外层索引的位置
df3.swaplevel()

             peice
高三上的邮局 小说       10
失踪的总统  小说       20
绿毛水怪   小说       30
皮囊     散文随笔     40
浮生六记   散文随笔     50
自在独行   散文随笔     60
梅西     传记       70
老舍自传   传记       80
库里传    传记       90

#### 2.使用sort index()可以通过分层所引对数据排序
DataFrame.sort_index(axis = 0, ascending = True, inplace = False)  
axis:轴  
ascending：表示是否升序  
inplace：是否修改原数据

In [38]:
df_obj = pd.DataFrame({
    'word':['a','b','d','e','f','s','d','s','l'],
    'num':[1,2,4,5,3,2,6,2,3]
    },
    index = [['A','A','A','C','C','C','B','B','B'],
            [1,3,2,3,1,2,4,5,8]]
)
df_obj

    word  num
A 1    a    1
  3    b    2
  2    d    4
C 3    e    5
  1    f    3
  2    s    2
B 4    d    6
  5    s    2
  8    l    3

In [39]:
# 按索引排序，从外到里排序
df_obj.sort_index()

    word  num
A 1    a    1
  2    d    4
  3    b    2
B 4    d    6
  5    s    2
  8    l    3
C 1    f    3
  2    s    2
  3    e    5

In [40]:
# 按值排序
df_obj.sort_values(['num'])

    word  num
A 1    a    1
  3    b    2
C 2    s    2
B 5    s    2
C 1    f    3
B 8    l    3
A 2    d    4
C 3    e    5
B 4    d    6

#### 算术运算
####　Series

In [42]:
# nan和任何数据进行计算都会得到nan，nan的数据类型是float
s1 = pd.Series([8.,1,2,34],index=['a','b','c','d'])
s1

a     8.0
b     1.0
c     2.0
d    34.0
dtype: float64

In [43]:
s2 = pd.Series([-3.0,-2.5,10,15,2.364],index=['a','f','c','g','e'])

In [44]:
s1 + s2

a     5.0
b     NaN
c    12.0
d     NaN
e     NaN
f     NaN
g     NaN
dtype: float64

In [45]:
s1.add(s2)

a     5.0
b     NaN
c    12.0
d     NaN
e     NaN
f     NaN
g     NaN
dtype: float64

#### DataFrame

In [47]:
df5 = pd.DataFrame(np.arange(9).reshape(3,3),columns = list('abc'),index = ['bj','sh','sz'])
df5

    a  b  c
bj  0  1  2
sh  3  4  5
sz  6  7  8

In [49]:
df6 = pd.DataFrame(np.arange(16).reshape(4,4),columns = list('abcd'),index = ['bj','sh','sz','cs'])
df6

     a   b   c   d
bj   0   1   2   3
sh   4   5   6   7
sz   8   9  10  11
cs  12  13  14  15

In [50]:
df5+df6

       a     b     c   d
bj   0.0   2.0   4.0 NaN
cs   NaN   NaN   NaN NaN
sh   7.0   9.0  11.0 NaN
sz  14.0  16.0  18.0 NaN

In [51]:
df5.mul(df6)

       a     b     c   d
bj   0.0   1.0   4.0 NaN
cs   NaN   NaN   NaN NaN
sh  12.0  20.0  30.0 NaN
sz  48.0  63.0  80.0 NaN

#### 两种数据结构之间的运算

In [52]:
df7 = pd.DataFrame(np.arange(9).reshape(3,3),columns = list('abc'),index = ['bj','sh','sz'])
df7

    a  b  c
bj  0  1  2
sh  3  4  5
sz  6  7  8

In [54]:
s5 = pd.Series(range(3),index = list('abc'))
s5

a    0
b    1
c    2
dtype: int64

In [55]:
#
df7+s5

    a  b   c
bj  0  2   4
sh  3  5   7
sz  6  8  10

In [56]:
df7.add(s5)

    a  b   c
bj  0  2   4
sh  3  5   7
sz  6  8  10